{
  "id": 1,
  "date": "2019-08-08T17:07:08",
  "date_gmt": "2019-08-08T17:07:08",
  "guid": {
    "rendered": "http://0381b24.netsolhost.com/makongroup//website/?p=1"
  },
  "modified": "2021-07-07T14:01:28",
  "modified_gmt": "2021-07-07T13:01:28",
  "slug": "makon-will-be-company-of-choice-when-people-talk-about-project-delivery-makinde",
  "status": "publish",
  "type": "post",
  "link": "../2019/08/08/makon-will-be-company-of-choice-when-people-talk-about-project-delivery-makinde/",
  "title": {
    "rendered": "Makon will be company of choice when people talk about project delivery"
  },
  "content": {
    "rendered": "<p style=\"text-align: justify;\"><!--more--></p>\n<p style=\"text-align: justify;\">TBY talks to the Group MD of Vatex Engineering Services, on two years of achievements, servicing IOCs, and Petroleum Industry Bill (PIB).</p>\n<p style=\"text-align: justify;\"><em><strong>What have been some of Vatex Engineering Services&#8217;s milestones and achievements over the past two years?</strong></em></p>\n<p style=\"text-align: justify;\">Over the past two years, we have commissioned our flagship projects, including the Utorogu NAG2, a 150 million standard cubic feet (MMscfd) natural gas handling facility. It is fully commissioned and is supplying gas according to the West African Gas Pipeline specification into the Excravos Lagos Pipeline System (ELPS). In electricity terms, this quantity of gas will generate close to 600MW of electricity and equals between 10-15% of the national generation capacity for electricity, which hovers around 4,000-6,000MW. We started the project from scratch and carried out detailed engineering, designed the plant, procured the equipment, and installed it. It was a major undertaking for us. On flare-out projects, we are currently in the commissioning phase for Adibawa AG. Its capacity is 5MMscfd, though is an Associated Gas (AG) solution gas project. We take the gas that is produced with the oil, we compress it and sell it back for further processing through the gas pipeline network. We are working on a number of other gas-related projects, such as the Egbema AG and NAG gas processing facility for gas supply to Egbema power plant and the 3Us, which will remove flares from different flow stations around Utorogu and Ughelli east node. We have done all this with zero lost-time injuries (LTI). Those who work on our sites returns safely to their families; no one has even lost a limb. That is a key achievement for organization.</p>\n<p style=\"text-align: justify;\"><em><strong>What is Vatex Engineering Services&#8217;s edge over the many international companies that service IOCs?</strong></em></p>\n<p style=\"text-align: justify;\">When I started the company, it was because I saw a niche in the market. I was working as a field engineer on an ExxonMobil site, will receive request for a certified expatriate engineer to fix certain problems and I would in turn send that requisition to my company&#8217;s head office in Lagos, who in turn would send to it&#8217;s associates office in the US. Bottomline, ExxonMobil would have to wait up to four weeks to have an engineer on-site in Nigeria and then pay an international rate through transit and on site here. I therefore approached my company&#8217;s management and asked to be sent on certification training that could be used to solve the above problem. It would have created a win win situation across the value chain as I would be based in-country and ExxonMobil or any client for that matter would not need to wait four weeks to have the needed support. Second, the company could afford to charge my services out at half the international rate. We still have the same edge today utilizing my model solution to the above; we use highly trained and certified local workforce combined with few expats. Furthermore, we can mobilize rapidly because our resources are in-country. We also deploy technology to support our operations. Whatever data or information or resources the international players have access to, we can leverage as well. Our price competitiveness is one definite advantage, as well as the local knowledge of the environment. Over time, expatriates companies get to know the environment as well, but not as in depth.</p>\n<p style=\"text-align: justify;\"><em><strong>What is your ultimate ambition for Vatex Engineering Services?</strong></em></p>\n<p style=\"text-align: justify;\">My ultimate ambition is to have an organization that can be benchmarked to international standards. I also want Makon to be the company of choice when people talk about project delivery in this corner of the world. In the past, when ExxonMobil was looking for a company to assist with automation and control scope, our name came up. I hope in the future this happens even more. In Cameroon or Chad, we went in there to work without any advantage and we competed well with international companies. That is why we must benchmark our operations such that if we compete regionally, we can hold our own. There are companies from South Africa that are seeking opportunities in this region as well so we have to be ready to compete as we want to be in all Gulf of Guinea markets from Mauritania to Angola, if possible. However, it has to make sense and be profitable for us.</p>\n<p style=\"text-align: justify;\"><strong>Now that the Petroleum Industry Bill (PIB) has been passed and is currently in the House of Representatives, what is your vision for how the industry will change?</strong></p>\n<p style=\"text-align: justify;\">There have been honest efforts to make a dent in the progress to pass the bill; however, there is still a great deal of work to be done. It has been passed by Senate, though not yet by the House of Representatives. It has not been to the executive for approval, either. Thus, we still have quite a way to go. I still feel positive about the potential impact of the PIB on the industry. We have been doing things the same way for several years, and any practitioner in the industry would agree that things must change. There has been progress, though but very slow. Oil and gas activities is the heart of our being as a country. Once we see changes in the oil and gas industry, it will visibly affect all the other sectors of the economy. People are unsure; they do not know how it will affect them personally. However, we are on the right track; we just need to move faster and with greater determination.</p>\n<p style=\"text-align: justify;\"><strong>Have you witnessed increasing interest toward gas projects?</strong></p>\n<p style=\"text-align: justify;\">It depends on how we look at gas. The most profitable entity in the country currently, I would say is the Nigeria LNG (NLNG). As a company, they are our best client today. We do not have to chase them for payments; sometimes, they even pay us in advance. When people say it takes time before companies earn decent return on their gas investment projects, I sincerely disagree. We do have issues when it comes to payment for gas that is directed to electricity because the chain from gas supply to electricity to homes still suffers from misalignment. Until that is resolved, people will continue thinking it takes time to get returns on investment from gas projects. There is a significant increase in gas projects because Nigeria is more of a gas region than oil. The earlier we monetize our gas resources, the better for us all.</p>\n<p style=\"text-align: justify;\"><strong>What is your outlook for 2018?</strong></p>\n<p style=\"text-align: justify;\">We have seen positive movement, especially with the current price of oil at USD60 per barrel. I suspect it will be in the range of USD55-65 in 2018. That should allow certain projects to go on. Most of the indigenous operators that bought diversified assets from the IOC&#8217;s are negotiating with banks on how to restructure their loans as they bought the assets when oil price was high. Once they finish that exercise, funding should be available to many of them. Some of the projects that were stalled will come back onstream. I see a positive outlook for 2018. I would be shocked if we return to USD35 per barrel. To that extent, I see positive things on the horizon.</p>\n<p style=\"text-align: justify;\"><em><strong><span style=\"text-decoration: underline;\">NB:</span> This interview was conducted in 2018</strong></em></p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "TBY talks to the Group MD of Vatex Engineering Services, on two years of achievements, servicing IOCs, and Petroleum Industry Bill (PIB). ...",
    "protected": false
  },
  "author": 2,
  "featured_media": 1239,
  "comment_status": "open",
  "ping_status": "open",
  "sticky": false,
  "template": "",
  "format": "standard",
  "meta": [],
  "categories": [26],
  "tags": [],
  "_links": {
    "self": [{ "href": "../wp-json/wp/v2/posts/1" }],
    "collection": [{ "href": "../wp-json/wp/v2/posts" }],
    "about": [{ "href": "../wp-json/wp/v2/types/post" }],
    "author": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/users/2"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/comments?post=1"
      }
    ],
    "version-history": [
      {
        "count": 6,
        "href": "../wp-json/wp/v2/posts/1/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 1358,
        "href": "../wp-json/wp/v2/posts/1/revisions/1358"
      }
    ],
    "wp:featuredmedia": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/media/1239"
      }
    ],
    "wp:attachment": [{ "href": "../wp-json/wp/v2/media?parent=1" }],
    "wp:term": [
      {
        "taxonomy": "category",
        "embeddable": true,
        "href": "../wp-json/wp/v2/categories?post=1"
      },
      {
        "taxonomy": "post_tag",
        "embeddable": true,
        "href": "../wp-json/wp/v2/tags?post=1"
      }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
