{
  "id": 835,
  "date": "2019-08-01T06:33:09",
  "date_gmt": "2019-08-01T05:33:09",
  "guid": { "rendered": "http://wpcharming.wpengine.com/construction/?p=1" },
  "modified": "2021-07-07T14:11:18",
  "modified_gmt": "2021-07-07T13:11:18",
  "slug": "in-makon-we-add-value-to-all-stakeholders-makinde",
  "status": "publish",
  "type": "post",
  "link": "../2019/08/01/in-makon-we-add-value-to-all-stakeholders-makinde/",
  "title": { "rendered": "In Makon, we add value to all stakeholders- MD" },
  "content": {
    "rendered": "<p style=\"text-align: justify;\"><!--more--></p>\n<p style=\"text-align: justify;\"><em><strong>Note: This interview was conducted in 2015</strong></em></p>\n<p style=\"text-align: justify;\">In this interview, the Group Managing Director of Vatex Engineering Services talks on the Nigerian Content Act, collaborating with partners, and the transforming regulatory landscape.</p>\n<p style=\"text-align: justify;\"><em><strong>What is the core of your business, and how do you differentiate yourselves from the competition in those fields of activity?</strong></em></p>\n<p style=\"text-align: justify;\">The core of the business is actually engineering and technical services for the oil, gas, LNG, and petrochemical industries. We started the business on the back of providing Nigerian content. In the past, an adequate level of expertise was not available in the country, whereby most of the qualified work was undertaken by foreign employees. We started thinking about how to make local workers productive, and get them the exposure they needed. The government understood that goal and officially signed the Nigerian Content Act. So the major differentiator for us is that ours is a Nigerian company playing in an environment that is mostly a domain for multinationals. Of course, we offer more competitive pricing, and we add value by training local engineers. At the end of the day, we see the development of a hub of expertise that can actually serve the Gulf of Guinea region, which stretches from Mauritania to Mozambique.</p>\n<p style=\"text-align: justify;\"><strong>How has the Nigerian Content Act changed the industry, and what has changed for your business?</strong></p>\n<p style=\"text-align: justify;\">The Act has changed the industry considerably. Yet, we are still not where we are supposed to be in terms of the economic activities coming out of the Nigeria. We are still low on capacity. We do have enough engineers, but some so-called engineers are not trainable. In some cases, this is because the education system is still focused on theory, as opposed to practice. However over time, the Act will generate the desired effect. We have multiplied our turnover by almost 30 over the past five to six years, simply because we were given the opportunity to do things locally. It was easier for us to key into that opportunity and drive it forward.</p>\n<p style=\"text-align: justify;\"><strong>How can the government support you in terms of training people for the future?</strong></p>\n<p style=\"text-align: justify;\">You cannot leave this to the government alone. We, as private entities, also need to play a role. As a matter of fact, we knew just recently that there is an industrial training fund set up by the government to ensure that, when you train your workers, you can either assess them or else have some money reimbursed for training and development. I think there is a need for government awareness, so that companies know that training is not just going to come from the bottom line. In the end, there is going to be a partnership between the private sector and the government.</p>\n<p style=\"text-align: justify;\"><strong>What kind of model do you operate for collaboration with partners?</strong></p>\n<p style=\"text-align: justify;\">Our model is truly simple, and based on understanding where the markets are. There is no problem setting up a facility closer to the region that we are trying to sell to. But if the market is predominantly Nigeria, then I really think that the best option is to sell our product in Nigeria. What we will not do is to simply be an agent collecting a commission. We feel that if we know there is value to be added by Nigerians, and there are projects going on here in Nigeria, we want to go into partnership. What we also saw was that, with very good engineers coming out of Nigeria, potential partners were even coming to us to work together in the region. We did work on the Chad-Cameroon pipeline project. Makon also worked on the West African Gas Pipeline Project, with our engineers in Benin, Togo, and Ghana. It has been a successful model for our partners, because when they have issues, suddenly there are engineers who know how to address them. Our engineers are predominantly from here, so they do not go to other regions. For clients, they have been able to have resources closer at hand. They can call us and we are just a couple of miles away. Also, it is cheaper for them. For an engineer in Nigeria, in this locality, we are not going to charge you the expert rate prevailing in Houston or Calgary. We charge local rates, but the staff is nonetheless well trained. Meanwhile, we add value for our stakeholders as well: the country, the shareholders, and individuals.</p>\n<p style=\"text-align: justify;\"><em><strong>Are you actively looking for partnerships or collaborations?</strong></em></p>\n<p style=\"text-align: justify;\">In the oil industry, technology is not stagnant. Companies are always developing new models. I think that building trust is important, and it is also good for our partners to see that value is being created here. Makon has been working with Rockwell Automation for a long time, and the same thing goes for ABB Nigeria.</p>\n<p style=\"text-align: justify;\"><em><strong>Where do you see the next opportunities in the gas industry?</strong></em></p>\n<p style=\"text-align: justify;\">There is great potential for growth, and Nigeria remains low on gas. We see growth in that area, and feel that if the Petroleum Industry Bill (PIB) is passed appropriately, it could open up the playing field. Also, the energy sector has huge potential if you look at how many Nigerians are still lacking a sufficient energy supply. And with a population of approximately 170 million people, if you develop a middle class, that represents a huge market in itself. We observed this in the telecoms sector. That market opened up slowly, but eventually Nigeria became a magnet for innovation when the momentum picked up. We believe wholeheartedly in this environment. I have been abroad to observe the industry, but we feel that there is huge local potential. And we will also have the opportunity to transform the country into the hub for the Gulf of Guinea.</p>\n<p style=\"text-align: justify;\"><em><strong>What would you change in the regulatory framework for the oil and gas sector?</strong></em></p>\n<p style=\"text-align: justify;\">Passing the PIB would change the landscape. And if you take the electricity sector, for example, I believe this government has done the hard work, by ensuring that the distribution and generating companies have been privatized. What I have seen over the past year and a half is that an entity such as the Nigerian Gas Company would perpetually owe something for its gas supply. Today, they pay for gas supply, because the end customer is no longer the government, but private entities. That act in itself has removed the dislocation in that sector. Once the PIB passes many elements will fall into place.</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "Note: This interview was conducted in 2015 In this interview, the Group Managing Director of Vatex Engineering Services talks on the Nigerian ...",
    "protected": false
  },
  "author": 2,
  "featured_media": 1033,
  "comment_status": "open",
  "ping_status": "open",
  "sticky": false,
  "template": "",
  "format": "standard",
  "meta": [],
  "categories": [26],
  "tags": [],
  "_links": {
    "self": [{ "href": "../wp-json/wp/v2/posts/835" }],
    "collection": [{ "href": "../wp-json/wp/v2/posts" }],
    "about": [{ "href": "../wp-json/wp/v2/types/post" }],
    "author": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/users/2"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/comments?post=835"
      }
    ],
    "version-history": [
      {
        "count": 5,
        "href": "../wp-json/wp/v2/posts/835/revisions"
      }
    ],
    "predecessor-version": [
      {
        "id": 1360,
        "href": "../wp-json/wp/v2/posts/835/revisions/1360"
      }
    ],
    "wp:featuredmedia": [
      {
        "embeddable": true,
        "href": "../wp-json/wp/v2/media/1033"
      }
    ],
    "wp:attachment": [
      {
        "href": "../wp-json/wp/v2/media?parent=835"
      }
    ],
    "wp:term": [
      {
        "taxonomy": "category",
        "embeddable": true,
        "href": "../wp-json/wp/v2/categories?post=835"
      },
      {
        "taxonomy": "post_tag",
        "embeddable": true,
        "href": "../wp-json/wp/v2/tags?post=835"
      }
    ],
    "curies": [
      { "name": "wp", "href": "https://api.w.org/{rel}", "templated": true }
    ]
  }
}
